Repository: Aniruddha120/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/the_elements.po
Languages: fr_fr, it_it

source: The Qiskit Elements
fr_fr: Les éléments de Qiskit
it_it: Gli Elementi di Qiskit

source: Terra, the ‘earth’ element, is the foundation on which the rest of Qiskit lies. Terra provides a bedrock for composing quantum programs at the level of circuits and pulses, to optimize them for the constraints of a particular device, and to manage the execution of batches of experiments on remote-access devices. Terra defines the interfaces for a desirable end-user experience, as well as the efficient handling of layers of optimization, pulse scheduling and backend communication.
fr_fr: Terra, l'élément "terre", est la fondation sur laquelle repose le reste de Qiskit. Terra fournit un socle pour la composition de programmes quantiques au niveau des circuits et des impulsions, pour les optimiser aux contraintes d'un système particulier, et pour gérer l'exécution d'expériences sur des systèmes distants. Terra définit les interfaces de l'utilisateur final, ainsi que le traitement efficace des couches d'optimisation, d'ordonnancement des impulsions et de communication au système.
it_it: Terra, l’elemento “terra”, è il fondamento su cui poggia il resto di Qiskit. Terra fornisce una base per comporre programmi quantistici a livello di circuiti e pulsazioni, ottimizzarli per i vincoli di un particolare dispositivo, e per gestire l'esecuzione di lotti di esperimenti su dispositivi di accesso remoto. Terra definisce le interfacce per l'esperienza utente finale desiderata, così come la gestione efficiente degli strati di ottimizzazione, pianificazione degli impulsi e comunicazione con il backend.

source: Qiskit Terra is organized in six main modules:
fr_fr: Qiskit Terra est organisé en six modules principaux:
it_it: Qiskit Terra e' diviso in sei moduli principali:

source: `Circuit <https://qiskit.org/documentation/apidoc/circuit.html>`__ A quantum circuit is a model for quantum computing in which a computation is done by performing a sequence of quantum operations (usually gates) on a register of qubits. A quantum circuit usually starts with the qubits in the :math:`|0,…,0>` state and these gates evolve the qubits to states that cannot be efficiently represented on a classical computer. To extract information on the state a quantum circuit must have a measurement which maps the outcomes (possible random due to the fundamental nature of quantum systems) to classical registers which can be efficiently represented.
fr_fr: `Circuit <https://qiskit.org/documentation/apidoc/circuit.html>`__ Un circuit quantique est un modèle de programmation quantique dans lequel un calcul est réalisé en effectuant une séquence d'opérations quantiques (généralement des portes) sur un registre de qubits. Un circuit quantique commence généralement par les qubits dans l'état :math:`|0,…, >` et les portes font évoluer les qubits vers des états qui ne peuvent pas être efficacement représentés sur un ordinateur classique. Pour extraire des informations sur son état, un circuit quantique doit avoir une mesure qui cartographie les résultats (valeurs aléatoires en raison de la nature fondamentale des systèmes quantiques) vers des registres classiques qui peuvent être représentés efficacement.
it_it: Il `Circuito <https://qiskit.org/documentation/apidoc/circuit.html>`__ Un circuito quantistico è un modello per il calcolo quantistico in cui si effettua un calcolo eseguendo una sequenza di operazioni quantistiche (di solito i gates) su un registro di qubit. Un circuito quantistico di solito inizia con i qubit nel :math:`<unk> 0,…, >` stato e i gates evolvono i qubit in stati che non possono essere rappresentati in modo efficiente su un computer classico. Per estrarre le informazioni sullo stato un circuito quantistico deve avere una misurazione che mappi i risultati (possibile casuale a causa della natura fondamentale dei sistemi quantistici) ai registri classici che possono essere rappresentati in modo efficiente.

source: `Pulse <https://qiskit.org/documentation/apidoc/pulse.html>`__ A pulse schedule is set of pulses which are sent to a quantum experiment that are applied to a channel (experimental input line). This is a lower level than circuits and requires each gate in the circuit to be represented as a set of pulses. At this level the experiments can be designed to reduce errors (dynamical decoupling, error mitigation, and optimal pulse shapes).
fr_fr: ` Pulse <https://qiskit.org/documentation/apidoc/pulse.html>` __ Un planning d'impulsions est un ensemble d'impulsions qui sont envoyées à une expérience quantique appliquée à un canal (ligne d'entrée expérimentale). Il s'agit d'un niveau inférieur à celui des circuits et nécessite que chaque porte du circuit soit représentée sous la forme d'un ensemble d'impulsions. À ce niveau, les expériences peuvent être conçues pour réduire les erreurs (découplage dynamique, atténuation des erreurs et formes optimales des impulsions).
it_it: Il `Pulse <https://qiskit.org/documentation/apidoc/pulse.html>`__ Una pianificazione dell'impulso è un insieme di impulsi inviati a un esperimento quantistico che vengono applicati a un canale (linea di ingresso sperimentale). Questo è un livello inferiore rispetto ai circuiti e richiede che ogni gate nel circuito sia rappresentato come un insieme di impulsi. A questo livello gli esperimenti possono essere progettati per ridurre gli errori (disaccoppiamento dinamico, attenuazione degli errori e forme ottimali di impulso).

source: `Transpiler <https://qiskit.org/documentation/apidoc/transpiler.html>`__ A major part of research on quantum computing is working out how to run a quantum circuits on real devices. In these devices, experimental errors and decoherence introduce errors during computation. Thus, to obtain a robust implementation it is essential to reduce the number of gates and the overall running time of the quantum circuit. The transpiler introduces the concept of a pass manager to allow users to explore optimization and find better quantum circuits for their given algorithm. We call it a transpiler as the end result is still a circuit.
fr_fr: ` Transpiler <https://qiskit.org/documentation/apidoc/transpiler.html>` __ Une grande partie de la recherche sur l'informatique quantique consiste à savoir comment executerg des circuits quantiques sur des appareils réels. Dans ces dispositifs, les erreurs expérimentales et la décohérence introduisent des erreurs lors du calcul. Pour obtenir une implémentation robuste, il est essentiel de réduire le nombre de portes et le temps de fonctionnement global du circuit quantique. Le transpiler introduit le concept de gestionnaire de passes pour permettre aux utilisateurs d'explorer l'optimisation et de trouver de meilleurs circuits quantiques pour leur algorithme. On appelle cela un transpiler car le résultat final est toujours un circuit.
it_it: Il `Transpiler <https://qiskit.org/documentation/apidoc/transpiler.html>`__ La maggior parte della ricerca sul Quantum Computing si sta impegnando nel capire come lanciare circuiti quantistici sui device reali. In questi dispositivi, gli errori sperimentali e la decoerenza introducono errori durante il calcolo. Pertanto, per ottenere una robusta implementazione è essenziale ridurre il numero di gates e il tempo di funzionamento complessivo del circuito quantistico. Il transpiler introduce il concetto di pass-manager per consentire agli utenti di esplorare l'ottimizzazione e trovare circuiti quantistici più in linea con il loro algoritmo. Questo sistema è chiamato transpiler perché il risultato finale è ancora un circuito.

source: `Providers <https://qiskit.org/documentation/apidoc/providers.html>`__ Once the user has made the circuits to run on the backend they need to have a convenient way of working with it. In Terra we do this using four parts:
fr_fr: ` Fournisseurs <https://qiskit.org/documentation/apidoc/providers.html>` __ Une fois que l'utilisateur a fait executer les circuits sur le système, il a besoin de pouvoir travailler de façon commode avec celui ci. Dans Terra, nous le faisons en 4 quatre parties:
it_it: Il `Provider <https://qiskit.org/documentation/apidoc/providers.html>`__ Una volta che l'utente ha fatto funzionare i circuiti sul backend, c'è bisogno di un modo conveniente per poter lavorare con essi. In Terra lo facciamo utilizzando quattro parti:

source: A `Provider <https://qiskit.org/documentation/api/qiskit.providers.BaseProvider.html>`__ is an entity that provides access to a group of different backends (for example, backends available through the `IBM Quantum Experience <https://quantum-computing.ibm.com>`__). It interacts with those backends to, for example, find out which ones are available, or retrieve an instance of a particular backend.
fr_fr: Un fournisseur <https://qiskit.org/documentation/api/qiskit.providers.BaseProvider.html>` __ est une entité qui fournit l'accès à un groupe de différents systèmes (par exemple, les backends/systèmes disponibles via IBM Quantum Experience <https://quantum-computing.ibm.com>` __). Il interagit avec ces backends, par exemple, pour savoir lesquels sont disponibles, ou récupérer une instance d'un système particulier.
it_it: Un `Provider <https://qiskit.org/documentation/api/qiskit.providers.BaseProvider.html>`__ è un'entità che fornisce l'accesso a un gruppo di backend diversi (per esempio, backend disponibili attraverso `IBM Quantum Experience <https://quantum-computing.ibm.com>`__). Il Provider interagisce con backend per scoprire, ad esempio, quali sono disponibili, o per recuperare un'istanza di un particolare backend.

source: `Backend <https://qiskit.org/documentation/api/qiskit.providers.BaseBackend.html>`__ represent either a simulator or a real quantum computer and are responsible for running quantum circuits and returning results. They have a run method which takes in a `qobj` as input and returns a `BaseJob` object. This object allows asynchronous running of jobs for retrieving results from a backend when the job is completed.
fr_fr: ` Backend/Système <https://qiskit.org/documentation/api/qiskit.providers.BaseBackend.html>` __ représente soit un simulateur, soit un véritable ordinateur quantique et est responsable de l'exécution des circuits quantiques et de fournir les résultats. Ils dispose d'une méthode d'exécution qui prend en entrée un objet ` qobj' et retourne un objet ` BaseJob'. Cet objet permet l'exécution asynchrone des travaux pour récupérer les résultats d'un système d'execution lorsque l'execution est terminée.
it_it: Il `Backend <https://qiskit.org/documentation/api/qiskit.providers.BaseBackend.html>`__ può rappresentare o un simulatore o un vero e proprio computer quantistico; entrambi sono responsabili dell'esecuzione di circuiti quantistici e del ritorno dei risultati. Hanno un metodo di esecuzione che prende in un `qobj` come input e restituisce un oggetto `BaseJob`. Questo oggetto permette l'esecuzione asincrona dei processi per recuperare i risultati da un backend quando il lavoro è completato.

source: `Job <https://qiskit.org/documentation/api/qiskit.providers.BaseJob.html>`__ instances can be thought of as the “ticket” for a submitted job. They find out the execution’s state at a given point in time (for example, if the job is queued, running, or has failed) and also allow control over the job.
fr_fr: Les instances `Job <https://qiskit.org/documentation/api/qiskit.providers.BaseJob.html>`__ peuvent être considérées comme le “ticket” pour une tâche soumise. Ils permettent de découvrir l’état de la tache à un instant donné (par exemple, si la tâche est mise en attente, en cours d'exécution ou a échoué) et permettent également le contrôle de la tâche.
it_it: La `Job <https://qiskit.org/documentation/api/qiskit.providers.BaseJob.html>`__ instance può essere pensata come il “ticket” per un lavoro sottomesso al sistema. Esso evidenzia lo stato di una esecuzione in un dato momento (per esempio, se il lavoro è in coda, in esecuzione, o è fallito) e consentire anche il controllo sul lavoro.

source: `Result <https://qiskit.org/documentation/stubs/qiskit.result.Result.html>`__. Once the job has finished Terra allows the results to be obtained from the remote backends using `result = job.result()`. This result object holds the quantum data and the most common way of interacting with it is by using `result.get_counts(circuit)`. This method allows the user to get the raw counts from the quantum circuit and use them for more analysis with quantum information tools provided by Terra.
fr_fr: ` Résultat <https://qiskit.org/documentation/stubs/qiskit.result.Result.html>` __. Une fois la tache terminée, Terra permet d'obtenir les résultats à partir des backends/systèmes distants à l'aide de "result = job.result ()". Cet objet de résultat contient les données quantiques et la façon la plus courante d'interagir avec lui est d'utiliser ` result.get_counts (circuit) `. Cette méthode permet à l'utilisateur d'obtenir les comptages bruts du circuit quantique et de les utiliser pour une analyse avec les outils d'information quantique fournis par Terra.
it_it: Il `Risultato <https://qiskit.org/documentation/stubs/qiskit.result.Result.html>`__. Una volta terminato il processo, Terra permette di ottenere i risultati dai backend remoti usando `result = job.result()`. Il risultato contiene i dati quantistici ed il modo più comune di interagire con lui è quello di usare `result.get_counts(nome_circuito)`. Questo metodo consente all'utente di ottenere una stima grezza dal circuito quantistico che può essere utilizzata per ulteriori analisi con gli strumenti di informazione quantistica forniti da Terra.

source: `Quantum Information <https://qiskit.org/documentation/apidoc/quantum_info.html>`__ To perform more advanced algorithms and analysis of the circuits run on the quantum computer, it is important to have tools to implement simple quantum information tasks. These include methods to both estimate metrics and generate quantum states, operations, and channels.
fr_fr: " Quantum Information <https://qiskit.org/documentation/apidoc/quantum_info.html>` __ Pour exécuter des algorithmes plus avancés et une analyse des circuits exécutés sur l'ordinateur quantique, il est important d'avoir des outils pour implémenter des tâches d'information quantique simples. Ceci incluent des méthodes permettant d'estimer les métriques et de générer des états quantiques, des opérations et des canaux.
it_it: § Quantum Information <https://qiskit.org/documentation/apidoc/quantum_info.html>` __ Per eseguire algoritmi e analisi più avanzate dei circuiti quantistici, è importante disporre di strumenti per implementare semplici attività di informazione quantistica. Questi includono metodi per stimare le metriche e generare stati quantistici, operazioni e canali.

source: `Visualization <https://qiskit.org/documentation/apidoc/visualization.html>`__ In Terra we have many tools to visualize a quantum circuit. This allows a quick inspection of the quantum circuit to make sure it is what the user wanted to implement. There is a text, python and latex version. Once the circuit has run it is important to be able to view the output. There is a simple function (`plot_histogram`) to plot the results from a quantum circuit including an interactive version. There is also a function `plot_state` and `plot_bloch_vector` that allow the plotting of a quantum state. These functions are usually only used when using the `statevector_simulator` backend but can also be used on real data after running state tomography experiments (Ignis).
fr_fr: ` Visualisation <https://qiskit.org/documentation/apidoc/visualization.html>` __ In Terra il y a plusieurs outils pour visualiser un circuit quantique. Cela permet une inspection rapide du circuit quantique pour s'assurer que c'est ce que l'utilisateur voulait mettre en œuvre. Il y des versions en texte, python et latex. Une fois le circuit exécuté, il est important de pouvoir visualiser le resultat. Il existe une fonction simple ("plot_histogramme") pour tracer les résultats d'un circuit quantique incluant une version interactive. Il y a aussi une fonction "plot_state" et " plot_bloch_vec" qui permettent le tracé d'un état quantique. Ces fonctions sont généralement utilisées uniquement lors de l'utilisation du backend "statevector_simulateur", mais peuvent également être utilisées sur des données réelles après avoir exécuté des expériences de tomographie d'état (Ignis).
it_it: `Visualizzazione <https://qiskit.org/documentation/apidoc/visualization.html>`__ In Terra vi sono molti strumenti per visualizzare un circuito quantistico. Ciò consente una rapida ispezione del circuito per assicurarsi che sia quello che l'utente ha voluto implementare. C'è una versione testo, Python e LaTeX. Una volta eseguito il circuito, è importante essere in grado di visualizzare l'output. C'è una funzione semplice (`plot_histogram`) per tracciare i risultati di un circuito quantistico compresa una versione interattiva. C'è anche una funzione `plot_state` e `plot_bloch_vector` che permettono il tracciamento di uno stato quantistico. Queste funzioni sono solitamente usate solo quando si utilizza il backend `statevector_simulator` ma possono anche essere usate su dati reali dopo aver eseguito esperimenti di tomografia a stato (Ignis).

source: Aer, the ‘air’ element, permeates all Qiskit elements. To really speed up development of quantum computers we need better simulators, emulators and debuggers. Aer helps us understand the limits of classical processors by demonstrating to what extent they can mimic quantum computation. Furthermore, we can use Aer to verify that current and near-future quantum computers function correctly. This can be done by stretching the limits of simulation, and by simulating the effects of realistic noise on the computation.
fr_fr: Aer, l'élément "air", est partout dans Qiskit. Pour accélérer le développement des ordinateurs quantiques, nous avons besoin de meilleurs simulateurs, émulateurs et débogueurs. Aer nous aide à comprendre les limites des processeurs classiques en démontrant jusque ou ils peuvent imiter le calcul quantique. De plus, nous pouvons utiliser Aer pour vérifier que les ordinateurs quantiques actuels fonctionnent correctement. Cela peut se faire en pousaant les limites de la simulation en simulant les effets du bruit réèl sur le calcul.
it_it: Aer, l’elemento “aria”, permea tutti gli elementi di Qiskit. Per velocizzare lo sviluppo dei computer quantistici abbiamo bisogno di migliori simulatori, emulatori e debugger. Aer ci aiuta a capire i limiti dei processori classici, dimostrando in che misura possono imitare il calcolo quantistico. Inoltre, possiamo usare Aer per verificare che i computer quantistici attuali e quasi futuri funzionino correttamente. Questo può essere fatto allungando i limiti della simulazione, e simulando gli effetti del rumore realistico sul calcolo.

source: Aer provides a high performance simulator framework for quantum circuits using the Qiskit software stack. It contains optimized C++ simulator backends for executing circuits compiled in Terra. Aer also provides tools for constructing highly configurable noise models for performing realistic noisy simulations of the errors that occur during execution on real devices.
fr_fr: Aer fournit un environnement de simulation haute performance pour les circuits quantiques à l'aide de la suite logiciele Qiskit. Il contient un simulateur C++ optimisé pour l'exécution de circuits compilés dans Terra. Aer fournit également des outils pour construire des modèles de bruit hautement configurables pour effectuer des simulations bruyantes et réalistes des erreurs qui se produisent lors de l'exécution sur des dispositifs réels.
it_it: Aer fornisce un framework di simulazione ad alte prestazioni per circuiti quantistici utilizzando lo stack software di Qiskit. Contiene un backend scritto in C++ ottimizzato per l'esecuzione di circuiti compilati in Terra. Aer fornisce anche strumenti per costruire modelli di rumore, altamente configurabili, per eseguire simulazioni rumorose realistiche degli errori che si verificano durante l'esecuzione su dispositivi reali.

source: Qiskit Aer includes three high performance simulator backends:
fr_fr: Qiskit Aer inclut trois simulateurs haute performance:
it_it: Qiskit Aer include tre simulatori backend ad alte prestazioni:

source: `Qasm Simulator <https://qiskit.org/documentation/stubs/qiskit.providers.aer.QasmSimulator.html>`__
fr_fr: ` Simulateur Qasm <https://qiskit.org/documentation/stubs/qiskit.providers.aer.QasmSimulator.html>` __

source: Allows ideal and noisy multi-shot execution of qiskit circuits and returns counts or memory. There are multiple methods that can be used that simulate different circuits more efficiently. These include:
fr_fr: Permet l'exécution multi-coups idéale ou bruyante de circuits qiskit et retourne les compteurs ou le contenu de la mémoire. Il y a plusieurs méthodes qui peuvent être utilisées pour simuler différents circuits plus efficacement. Celles-ci incluent:
it_it: Permette l'esecuzione multi-shot ideale e rumorosa dei circuiti di Qiskit e restituisce conteggi o memoria. Ci sono più metodi che possono essere utilizzati che simulano i diversi circuiti in modo più efficiente. Questi includono:

source: *statevector* - Uses a dense statevector simulation.
fr_fr: * stateVecteur *-Utilise une simulation dense de vecteur d'état.
it_it: * statevector * - Utilizza una densa simulazione statevector.

source: *stabilizer* - Uses a Clifford stabilizer state simulator that is only valid for Clifford circuits and noise models.
fr_fr: *stabilisateur* - Utilise un simulateur d'état stabilisateur Clifford qui n'est valide que pour les circuits Clifford et les modèles de bruit.
it_it: *stabilizer* - Utilizza uno stabilizzatore Clifford di simulatori di stato che è valido solo per i circuiti Clifford e per i modelli di rumore.

source: *extended_stabilizer* - Uses an approximate simulator that decomposes circuits into stabilizer state terms, the number of which grows with the number of non-Clifford gates.
fr_fr: *extended_stabilizer* - Utilise un simulateur approximatif qui décompose les circuits en termes d'état stabilisateur, dont le nombre augmente avec le nombre de portes non-Clifford.
it_it: * extended_stabilizer * - Utilizza un simulatore approssimativo che decompone i circuiti in termini di stati stabilizzatori, il cui numero cresce con il numero di porte non Clifford.

source: *matrix_product_state* - Uses a Matrix Product State (MPS) simulator.
fr_fr: *matrix_product_state* - Utilise un simulateur d'état du produit de la matrice (MPS).
it_it: * matrix_product_state * - Utilizza un simulatore MPS (Matrix Product State).

source: `Statevector Simulator <https://qiskit.org/documentation/stubs/qiskit.providers.aer.StatevectorSimulator.html>`__
fr_fr: ` Simulateur de Statevecteur <https://qiskit.org/documentation/stubs/qiskit.providers.aer.StatevectorSimulator.html>` __
it_it: ` Simulatore Statevector <https://qiskit.org/documentation/stubs/qiskit.providers.aer.StatevectorSimulator.html>` __

source: Allows ideal single-shot execution of qiskit circuits and returns the final statevector of the simulator after application.
fr_fr: Permet l'exécution idéale unique (single-shot) de circuits qiskit et retourne le vecteur d'état (statevector) final du simulateur.
it_it: Consente l'esecuzione ideale di circuiti Qiskit e restituisce lo statevector finale del simulatore dopo l'applicazione.
