Repository: Aniruddha120/qiskit-translations
Catalog: docs/locale/*/LC_MESSAGES/the_elements.po
Languages: fr_fr, it_it

source: `Unitary Simulator <https://qiskit.org/documentation/stubs/qiskit.providers.aer.UnitarySimulator.html>`__
fr_fr: "Simulateur unitaire" <https://qiskit.org/documentation/stubs/qiskit.providers.aer.UnitarySimulator.html>` __
it_it: `Simulatore unitario <https://qiskit.org/documentation/stubs/qiskit.providers.aer.UnitarySimulator.html>`__

source: Allows ideal single-shot execution of qiskit circuits and returns the final unitary matrix of the circuit itself. Note that the circuit cannot contain measure or reset operations for this backend.
fr_fr: Permet l'exécution idéale unitaire (single-shot) de circuit qiskit et retourne la dernière matrice unitaire du circuit lui-même. Notez que le circuit ne peut pas contenir des opérations de mesure ou de réinitialisation pour ce système d'exécution.
it_it: Consente l'esecuzione ideale di circuiti Qiskit e restituisce la matrice unitaria finale del circuito stesso. Da notare che il circuito non può contenere operazioni di misura o di reset per questo backend.

source: Ignis, the ‘fire’ element, is dedicated to fighting noise and errors and to forging a new path. This includes better characterization of errors, improving gates, and computing in the presence of noise. Ignis is meant for those who want to design quantum error correction codes, or who wish to study ways to characterize errors through methods such as tomography, or even to find a better way for using gates by exploring dynamical decoupling and optimal control.
fr_fr: Ignis, l'élément "feu", est dédié au combat contre le bruit et les erreurs et à la construction de nouvelles approches. Cela comprend une meilleure caractérisation des erreurs, l'amélioration des portes et le calcul en présence de bruit. Ignis est destiné à ceux qui veulent concevoir des codes de correction d'erreurs quantiques, ou qui souhaitent étudier la façon de caractériser les erreurs par des méthodes telles que la tomographie, ou même pour trouver une meilleure façon d'utiliser des portes en explorant le découplage dynamique et le contrôle optimal.
it_it: Ignis, l’elemento “fuoco”, è dedicato a combattere contro il rumore e gli errori e alla formazione di un nuovo percorso. Ciò include una migliore caratterizzazione degli errori, il miglioramento dei gate e il calcolo in presenza di rumore. Ignis è destinato a coloro che vogliono progettare codici di correzione degli errori quantistici, o che desiderano studiare modi per caratterizzare gli errori attraverso metodi come la tomografia, o anche trovare un modo migliore per utilizzare i gate esplorando il disaccoppiamento dinamico e il controllo ottimale.

source: Ignis provides code for users to easily generate circuits for specific experiments given a minimal set of user input parameters. Ignis code contains three fundamental building blocks:
fr_fr: Ignis fournit le code permettant aux utilisateurs de générer facilement des circuits pour des expériences spécifiques, compte tenu d'un ensemble minimal de paramètres d'entrée utilisateur. Le code d'Ignis contient trois blocs fondamentaux:
it_it: Ignis fornisce agli utenti il codice per generare facilmente circuiti per esperimenti specifici dato un set minimale di parametri di input dell'utente. Il codice Ignis contiene tre pilastri fondamentali:

source: The circuits module provides the code to generate the list of circuits for a particular Ignis experiment based on a minimal set of user parameters. These are then run on Terra or Aer.
fr_fr: Le module de circuits fournit le code permettant de générer la liste des circuits pour une expérience d'Ignis particulière basée sur un ensemble minimal de paramètres utilisateur. Ils sont ensuite exécutés sur Terra ou Aer.
it_it: Il modulo dei circuiti fornisce il codice per generare la lista di circuiti per un particolare esperimento Ignis basato su una serie minimale di parametri dell'utente. Questi vengono poi eseguiti su Terra o Aer.

source: **Fitters**
fr_fr: ** Raccords (Fitters)**

source: The results of an Ignis experiment are passed to the Fitters module where they are analyzed and fit according to the physics model describing the experiment. Fitters can plot the data plus fit and output a list of parameters.
fr_fr: Les résultats d'une expérience d'Ignis sont transmis au module de raccords (Fitters) où ils sont analysés et adaptés selon le modèle physique décrivant l'expérience. Les raccords (fitters) peuvent déterminer les données et leur ajustement et fournir en sortie une liste de paramètres.
it_it: I risultati di un esperimento Ignis vengono trasmessi al modulo Fitters dove vengono analizzati e adattati secondo il modello fisico che descrive l'esperimento. Fitters può generare grafici sui dati e produrre un elenco di parametri.

source: **Filters**
fr_fr: ** Filtres**
it_it: **Filtri**

source: For certain Ignis experiments, the fitters can output a Filter object. Filters can be used to mitigate errors in other experiments using the calibration results of an Ignis experiment.
fr_fr: Pour certaines expériences d'Ignis, les raccords (fitters) peuvent générer un objet Filter. Les filtres peuvent être utilisés pour atténuer les erreurs dans d'autres expériences en utilisant les résultats d'étalonnage d'une expérience d'Ignis.
it_it: Per alcuni esperimenti di Ignis, i Fitters possono emettere un oggetto Filter. I filtri possono essere utilizzati per mitigare gli errori in altri esperimenti utilizzando i risultati di calibrazione di un esperimento Ignis.

source: Qiskit Ignis is organized into three types of experiments that can be performed:
fr_fr: Qiskit Ignis est organisé en trois types d'expériences qui peuvent être réalisées:
it_it: Qiskit Ignis è organizzato in tre tipi di esperimenti che possono essere eseguiti:

source: `Characterization <https://qiskit.org/documentation/apidoc_legacy/ignis/characterization/characterization.html>`__
fr_fr: " Caractérisation <https://qiskit.org/documentation/apidoc_legacy/ignis/characterization/characterization.html>` __
it_it: ` Caratterizzazione <https://qiskit.org/documentation/apidoc_legacy/ignis/characterization/characterization.html>` __

source: Characterization experiments are designed to measure parameters in the system such as noise parameters (T1, T2-star, T2), Hamiltonian parameters such as the ZZ interaction rate and control errors in the gates.
fr_fr: Les expériences de caractérisation sont conçues pour mesurer les paramètres dans le système tels que les paramètres de bruit (T1, T2-star, T2), les paramètres hamiltoniens tels que le taux d'interaction ZZ et les erreurs de contrôle dans les portes.
it_it: Gli esperimenti di caratterizzazione sono progettati per misurare i parametri nel sistema come i parametri di rumore (T1, T2-star, T2), parametri Hamiltoniani, come il tasso di interazione ZZ e errori di controllo nei gates.

source: `Verification <https://qiskit.org/documentation/apidoc_legacy/ignis/verification/verification.html>`__
fr_fr: ` Vérification <https://qiskit.org/documentation/apidoc_legacy/ignis/verification/verification.html>` __
it_it: ` Verifica <https://qiskit.org/documentation/apidoc_legacy/ignis/verification/verification.html>` __

source: Verification experiments are designed to verify gate and small circuit performance. Verification includes state and process tomography, quantum volume and randomized benchmarking (RB). These experiments provide the information to determine performance metrics such as the gate fidelity.
fr_fr: Les expériences de vérification sont conçues pour vérifier la performance des portes et des petits circuits. La vérification comprend la tomographie des états et des processus, le volume quantique et l'analyse comparative aléatoire (RB randomized benchmarking). Ces expériences fournissent des informations permettant de déterminer les mesures de performances telles que la fidélité des portes.
it_it: Gli esperimenti di verifica sono progettati per verificare le prestazioni di porte e piccoli circuiti. La verifica include tomografia di stato e di processo, volume quantico e benchmark randomizzati (RB). Questi esperimenti forniscono informazioni per determinare misure di prestazione come la fedeltà dei gate.

source: `Mitigation <https://qiskit.org/documentation/apidoc_legacy/ignis/mitigation/mitigation.html>`__
fr_fr: ` Atténuation <https://qiskit.org/documentation/apidoc_legacy/ignis/mitigation/mitigation.html>` __
it_it: `Mitigazione <https://qiskit.org/documentation/apidoc_legacy/ignis/mitigation/mitigation.html>`__

source: Mitigation experiments run calibration circuits that are analyzed to generate mitigation routines that can be applied to arbitrary sets of results run on the same backend. Ignis code will generate a list of circuits that run calibration measurements. The results of these measurements will be processed by a Fitter and will output a Filter than can be used to apply mitigation to other results.
fr_fr: Les expériences d'atténuation exécutent des circuits d'étalonnage qui sont analysés pour générer des routines d'atténuation qui peuvent être appliquées à des ensembles arbitraires de résultats exécutés sur le même système d'execution. Le code d'Ignis générera une liste de circuits qui exécutent des mesures d'étalonnage. Les résultats de ces mesures seront traités par un ajusteur (Fitter) et permettront de produire un filtre que l'on peut utiliser pour appliquer ces atténuations à d'autres résultats.
it_it: Gli esperimenti di mitigazione eseguono circuiti di calibrazione, i quali vengono analizzati per generare routine di attenuazione che possono poi essere applicate a una serie arbitraria di risultati eseguiti sullo stesso backend. Il codice Ignis genererà un elenco di circuiti che eseguono misurazioni di calibrazione. I risultati di queste misurazioni saranno elaborati da un Fitter e produrranno un Filter che può essere utilizzato per applicare queste attenuazioni ad altri risultati.

source: Aqua, the ‘water’ element, is the element of life. To make quantum computing live up to its expectations, we need to find real-world applications. Aqua is where algorithms for quantum computers are built. These algorithms can be used to build applications for quantum computing. Aqua is accessible to domain experts in chemistry, optimization, finance and AI, who want to explore the benefits of using quantum computers as accelerators for specific computational tasks.
fr_fr: Aqua, l'élément "eau", est l'élément de la vie. Pour que l'informatique quantique soit à la hauteur des attentes, nous devons trouver des utilisations concrètes. Aqua est l'endroit où sont construits les algorithmes des ordinateurs quantiques. Ces algorithmes peuvent être utilisés pour construire des applications pour l'informatique quantique. Aqua est accessible aux experts de domaines de la chimie, de l'optimisation, des finances et de l'IA, qui veulent explorer les avantages de l'utilisation d'ordinateurs quantiques comme accélérateurs pour des tâches informatiques spécifiques.
it_it: Aqua, l’elemento “acqua”, è l’elemento della vita. Per far sì che il quantum computing sia all’altezza delle sue aspettative, dobbiamo trovare delle applicazioni nel mondo reale. Aqua è dove vengono costruiti gli algoritmi per i computer quantistici. Questi algoritmi possono essere utilizzati per costruire applicazioni per la computazione quantistico. Aqua è accessibile agli esperti in chimica, ottimizzazione, finanza e IA, che vogliono esplorare i vantaggi di utilizzare computer quantistici come acceleratori per compiti di calcolo specifici.

source: Problems that may benefit from the power of quantum computing have been identified in numerous domains, such as Chemistry, Artificial Intelligence (AI), Optimization and Finance. Quantum computing, however, requires very specialized skills. To address the needs of the vast population of practitioners who want to use and contribute to quantum computing at various levels of the software stack, we have created Qiskit Aqua.
fr_fr: Les problèmes qui peuvent bénéficier de la puissance de l'informatique quantique ont été identifiés dans de nombreux domaines, tels que la chimie, l'intelligence artificielle (IA), l'optimisation et les finances. Toutefois, l'informatique quantique nécessite des compétences très spécialisées. Pour répondre aux besoins des nombreux praticiens qui veulent utiliser et contribuer à l'informatique quantique à différents niveaux de la pile logicielle, nous avons créé Qiskit Aqua.
it_it: Problemi che potrebbero trarre beneficio dalla potenza della computazione quantistica sono stati identificati in numerosi domini, ad esempio la Chimica, l'Intelligenza Artificiale (IA), l'Ottimizzazione e la Finanza. Tuttavia la computazione quantistica richiede competenze molto specializzate. Per rispondere alle esigenze della grande popolazione di praticanti che desiderano contribuire alla computazione quantistica a vari livelli dello stack software, abbiamo creato Qiskit Aqua.

source: **Circuits**
it_it: **Circuiti**
